espressif/esp-idf/examples/protocols/sockets/udp_multicast/sdkconfig.ci.default
CONFIG_IDF_TARGET="esp32"

CONFIG_EXAMPLE_IPV4_V6=y
CONFIG_EXAMPLE_LOOPBACK=n
CONFIG_EXAMPLE_CONNECT_IPV6=y

CONFIG_EXAMPLE_CONNECT_ETHERNET=y
CONFIG_EXAMPLE_CONNECT_WIFI=n
CONFIG_EXAMPLE_USE_INTERNAL_ETHERNET=y
CONFIG_EXAMPLE_ETH_PHY_GENERIC=y
CONFIG_EXAMPLE_ETH_MDC_GPIO=23
CONFIG_EXAMPLE_ETH_MDIO_GPIO=18
CONFIG_EXAMPLE_ETH_PHY_RST_GPIO=5
CONFIG_EXAMPLE_ETH_PHY_ADDR=1
